Revit 2025 API
StairsUndersideSurfaceStyle Enumeration
 The style of the underside surface of the run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StairsUndersideSurfaceStyle
Public Enumeration StairsUndersideSurfaceStyle
public enum class StairsUndersideSurfaceStyle
type StairsUndersideSurfaceStyle
Members
Member name | Value | Description
Stepped | 0 |  The underside surface of the run is stepped.
Smooth | 1 |  The underside surface of the run is smooth.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace